content-org/all-posts.org
#+hugo_base_dir: ../
#+options: toc:nil creator:t d:t

#+tags: [ emacs : org elisp ]
#+tags: [ org : ox_hugo ]
#+tags: [ nix : nixos devshell ]
#+tags: [ linux : nixos ]
#+tags: [ nixos : devos ]

#+macro: twa @@html:<span class="twa twa-lg twa-$1"></span>@@

* DONE TIL: Custom commands for DevOS's DevShell! :devos:devshell:
:PROPERTIES:
:EXPORT_FILE_NAME: devos-devshell-custom-commands
:EXPORT_DESCRIPTION:  Build amazing dev tools super fast!
:END:
:LOGBOOK:
- State "DONE"       from "DOING"      [2022-11-23 mer. 19:28]
- State "DOING"      from "DONE"       [2022-11-23 mer. 19:28]
- State "DONE"       from "TODO"       [2022-11-18 ven. 16:51]
- State "TODO"       from              [2022-11-18 ven. 16:08]
:END:
** Introduction
If you are using [[https://github.com/divnix/digga/tree/main/examples/devos][DevOS]] which is the official template for using [[https://github.com/divnix/digga][digga]], you may find that some friendlier commands are needed for example to rebuild your =NixOS= system.
In this blog post, we'll cover exactly how to do that! :grin:
** Implementation
In your =<your-config>/shell/devos.nix= file, you will find a =commands= list, where you're be able to add your own set of commands:
#+begin_src nix
{ pkgs, extraModulesPath, inputs, lib, ... }:
...
{
  ...
  commands = [
    ...
    { # A command shipped with devos
      category = "devos";
      name = nvfetcher-bin.pname;
      help = nvfetcher-bin.meta.description;
      command = "cd $PRJ_ROOT/pkgs; ${nvfetcher-bin}/bin/nvfetcher -c ./sources.toml $@";
    }
    { # Our custom command!
      category = "devos";
      name = "switch";
      help = "Makes rebuilding easy! | usage: switch <config>";
      command = "sudo nixos-rebuild switch --flake .#$@";
    }
    ...
  ]
  ;
}
#+end_src
In this case, we added a =switch= command!
We provided a name for it, a help message, as well as the command that will be executed when using =switch=.

After reloading the =envrc= using =direnv reload= in the command line, we get the following prompt:
#+begin_src shell
[devos]

  agenix               - age-encrypted secrets for NixOS
  cachix               - Command line client for Nix binary cache hosting https://cachix.org
  deploy-rs            - A Simple multi-profile Nix-flake deploy tool
  nix                  - Powerful package manager that makes package management reliable and reproducible
  nixos-generators     - Collection of image builders
  nvfetcher            - Generate nix sources expr for the latest version of packages
  switch               - Makes rebuilding easy! | usage: switch <config>

[docs]

  mdbook               - Create books from MarkDown

[general commands]

  menu                 - prints this menu

[linter]

  editorconfig-checker - A tool to verify that your files are in harmony with your .editorconfig
  nixpkgs-fmt          - Nix code formatter for nixpkgs
#+end_src
The custom =switch= command in under the =devos= section/category, with the help message that we wanted.

** Results
And we can now rebuild and switch to a new or different version of our NixOS/DevOS config super easily :partying_face:!
#+begin_src shell
switch <your-config>
# Instead of:
sudo nixos-rebuild switch --flake .#<your-config>
#+end_src
